from MeiMayakkam_Ruleset import *

print ("மெய்ம்மயக்கம் விளையாட்டை விளையாடலாமா")
print ("மெய்ம்மயக்க விளையாட்டை விளையாடப் படிநிலைகளுள் ஒன்றைத் தெரிவுசெய்க")

படிநிலைகள் = [
"1. க்+க",
"2. ங்+கங",
"3. ச்+ச",
"4. ஞ்+சஞய",
"5. ட்+கசடப",
"6. ண்+கசஞடணபமயவ",
"7. த்+த",
"8. ந்+தநய",
"9. ப்+ப",
"10. ம்+பமயவ",
"11. ய்+கசதபஞநமயவங",
"12. ர்+கசதபஞநமயவங",
"13. ழ்+கசதபஞநமயவங",
"14. வ்+வ",
"15. ல்+கசபலயவ",
"16. ள்+கசபளயவ",
"17. ற்+கசபற",
"18. ன்+கசஞபமயவறன",
"19. ர, ழ குற்று ஒற்று ஆகா"
]

# ஒவ்வொரு படிநிலையையும் தனித்தனி வரியாக அச்சிடு
for படிநிலை in படிநிலைகள்:
  print(படிநிலை)
  
விளையாடும்_களமுறை = 20

while விளையாடும்_களமுறை > 0:
	விளையாடும்_களமுறை = விளையாடும்_களமுறை - 1

	தெரிவுசெய் = input("விளையாடும் விதியைத் தெரிவுசெய் : ")
	#print (தெரிவுசெய் )
	உள்ளீட்டுச்சொல் = input("ஒரு சொல்லைத் தருக : ")

	if தெரிவுசெய் == "1" and meymayakkam1(உள்ளீட்டுச்சொல்):
			print ("மெய்ம்மயக்க விதி1இன்படி சரியான சொல்")
	elif தெரிவுசெய் == "2" and meymayakkam2(உள்ளீட்டுச்சொல்):
			print ("மெய்ம்மயக்க விதி2இன்படி சரியான சொல்")
	elif தெரிவுசெய் == "3" and meymayakkam3(உள்ளீட்டுச்சொல்):
			print ("மெய்ம்மயக்க விதி3இன்படி சரியான சொல்")
	elif தெரிவுசெய் == "4" and meymayakkam4(உள்ளீட்டுச்சொல்):
			print ("மெய்ம்மயக்க விதி4இன்படி சரியான சொல்")			
	elif தெரிவுசெய் == "5" and meymayakkam5(உள்ளீட்டுச்சொல்):
			print ("மெய்ம்மயக்க விதி5இன்படி சரியான சொல்")
	elif தெரிவுசெய் == "6" and meymayakkam6(உள்ளீட்டுச்சொல்):
			print ("மெய்ம்மயக்க விதி6இன்படி சரியான சொல்")
	elif தெரிவுசெய் == "7" and meymayakkam7(உள்ளீட்டுச்சொல்):
			print ("மெய்ம்மயக்க விதி7இன்படி சரியான சொல்")
	elif தெரிவுசெய் == "8" and meymayakkam8(உள்ளீட்டுச்சொல்):
			print ("மெய்ம்மயக்க விதி8இன்படி சரியான சொல்")
	elif தெரிவுசெய் == "9" and meymayakkam9(உள்ளீட்டுச்சொல்):
			print ("மெய்ம்மயக்க விதி9இன்படி சரியான சொல்")
	elif தெரிவுசெய் == "10" and meymayakkam10(உள்ளீட்டுச்சொல்):
			print ("மெய்ம்மயக்க விதி10இன்படி சரியான சொல்")			
	elif தெரிவுசெய் == "11" and meymayakkam11(உள்ளீட்டுச்சொல்):
			print ("மெய்ம்மயக்க விதி11இன்படி சரியான சொல்")
	elif தெரிவுசெய் == "12" and meymayakkam12(உள்ளீட்டுச்சொல்):
			print ("மெய்ம்மயக்க விதி12இன்படி சரியான சொல்")
	elif தெரிவுசெய் == "13" and meymayakkam13(உள்ளீட்டுச்சொல்):
			print ("மெய்ம்மயக்க விதி13இன்படி சரியான சொல்")
	elif தெரிவுசெய் == "14" and meymayakkam14(உள்ளீட்டுச்சொல்):
			print ("மெய்ம்மயக்க விதி14இன்படி சரியான சொல்")
	elif தெரிவுசெய் == "15" and meymayakkam15(உள்ளீட்டுச்சொல்):
			print ("மெய்ம்மயக்க விதி15இன்படி சரியான சொல்")
	elif தெரிவுசெய் == "16" and meymayakkam16(உள்ளீட்டுச்சொல்):
			print ("மெய்ம்மயக்க விதி16இன்படி சரியான சொல்")			
	elif தெரிவுசெய் == "17" and meymayakkam17(உள்ளீட்டுச்சொல்):
			print ("மெய்ம்மயக்க விதி17இன்படி சரியான சொல்")
	elif தெரிவுசெய் == "18" and meymayakkam18(உள்ளீட்டுச்சொல்):
			print ("மெய்ம்மயக்க விதி18இன்படி சரியான சொல்")
	elif தெரிவுசெய் == "19" and meymayakkam19(உள்ளீட்டுச்சொல்):
			print ("மெய்ம்மயக்க விதி19இன்படி சரியான சொல்")
	else:
		print ("மெய்ம்மயக்க விதிகளின்படி இது தவறான சொல். மீண்டும் விளையாடுங்கள்.")

