from meymayakkamfinal1 import *

print ("மெய்ம்மயக்கம் விளையாட்டை விளையாடலாமா")
print ("மெய்ம்மயக்க விளையாட்டை விளையாடப் படிநிலைகளுள் ஒன்றைத் தெரிவுசெய்க")

படிநிலைகள் = [
"1. க்+க",
"2. ங்+கங",
"3. ச்+ச",
"4. ஞ்+சஞய",
"5. ட்+கசடப",
"6. ண்+கசஞடணபமயவ",
"7. த்+த",
"8. ந்+தநய",
"9. ப்+ப",
"10. ம்+பமயவ",
"11. ய்+கசதபஞநமயவங",
"12. ர்+கசதபஞநமயவங",
"13. ழ்+கசதபஞநமயவங",
"14. வ்+வ",
"15. ல்+கசபலயவ",
"16. ள்+கசபளயவ",
"17. ற்+கசபற",
"18. ன்+கசஞபமயவறன",
"19. ர, ழ குற்று ஒற்று ஆகா"
]

print (படிநிலைகள் )

விதிகள் = [meymayakkam1, meymayakkam2, meymayakkam3, meymayakkam4, meymayakkam5, meymayakkam6, meymayakkam7, meymayakkam8, meymayakkam9, meymayakkam10, meymayakkam11, meymayakkam12, meymayakkam13, meymayakkam14, meymayakkam15, meymayakkam16, meymayakkam17, meymayakkam18, meymayakkam19]

தெரிவுசெய் = input("விளையாடும் விதியைத் தெரிவுசெய் : ")
#print (தெரிவுசெய் )
உள்ளீட்டுச்சொல் = input("ஒரு சொல்லைத் தருக : ")
	
விளையாடும்_களமுறை = 20

while விளையாடும்_களமுறை > 0:
	விளையாடும்_களமுறை = விளையாடும்_களமுறை - 1

if தெரிவுசெய் == "1" and meymayakkam1(உள்ளீட்டுச்சொல்):
		print ("மெய்ம்மயக்க விதி1இன்படி சரியான சொல்")
elif தெரிவுசெய் == "2" and meymayakkam2(உள்ளீட்டுச்சொல்):
		print ("மெய்ம்மயக்க விதி2இன்படி சரியான சொல்")
else:
	print ("மெய்ம்மயக்க விதிகளின்படி இது தவறான சொல். மீண்டும் விளையாடுங்கள்.")

